2023-12-01
[12:59:47.0483] <Chris Peterson (:cpeterson)>
Looks like there might be a GC OOM regression, or at least a new crash signature, starting in 117: https://bugzilla.mozilla.org/show_bug.cgi?id=1867864. 88% of the crash reports are from 32-bit Android devices.


2023-12-04
[23:53:55.0618] <jonco>
> <@cpeterson:mozilla.org> Looks like there might be a GC OOM regression, or at least a new crash signature, starting in 117: https://bugzilla.mozilla.org/show_bug.cgi?id=1867864. 88% of the crash reports are from 32-bit Android devices.

This is OOM during nursery collection. I've duped it to the catch-all bug for those signatures.

[23:57:16.0416] <jonco>
There does seem to be a big ramp up in these OOMs in the last couple of weeks which is concerning though.

[09:08:23.0818] <sfink>
This is a concern I have with nursery string buffers. If we need to malloc a buffer to hold the chars when tenuring, and that malloc fails, we'll get an unhandleable OOM. (The above bug doesn't match, though. It's allocating the Cell, not the buffer, and nursery string buffers landed in 122.)


2023-12-05
[09:16:02.0584] <smaug>
jonco: sfink: why would we trigger JS::GCReason::COMPARTMENT_REVIVED when running sp3? It just runs tests in same origin iframes

[09:17:04.0832] <smaug>
The meaning of JS::GCReason::COMPARTMENT_REVIVED has changed from what it was initially 

[09:21:27.0583] <jonco>

  mEnd = {mPtr = 0x7ffff0053780 "9007199254741001 ", mRangeStart = 0x7ffff0053780 "9007199254741001 ",
    mRangeEnd = 0x7ffff0053790 " "}}
```

which seems very weird, and I'm confused

[07:20:32.0578] <Ms2ger>
Did you mean `StringToBigInt`?

[07:20:53.0455] <Redfire>
err, yes, my bad

[07:22:34.0416] <Ms2ger>
I would suspect an API mismatch passing a struct as big as `Range`

[07:24:20.0037] <Redfire>
also fails without debugmozjs though

[07:24:42.0721] <Redfire>
which is only 2 u64's

[07:26:12.0327] <arai>
have you verified that `$1.mStart.mPtr` points the right value?

[07:27:08.0913] <Ms2ger>
Yeah, 0x7ffff0053780 points to "9007199254741001"

[07:27:09.0733] <arai>
do you see the same value in C++ side of `JS::StringToBigInt` ?  or it becomes different value?

[07:28:10.0692] <Redfire>
> <@arai:mozilla.org> do you see the same value in C++ side of `JS::StringToBigInt` ?  or it becomes different value?

`$2.mEnd = $1.mStart` somehow

[07:28:22.0631] <Redfire>
> <@arai:mozilla.org> do you see the same value in C++ side of `JS::StringToBigInt` ?  or it becomes different value?

that is the C++ side

[07:29:46.0211] <arai>
do you mean `chars.mStart.mPtr` points the end of the string, at the beginning of C++ side of `JS::StringToBigInt` ?

[07:30:22.0639] <arai>
err, I misread

[07:31:04.0385] <Redfire>
`chars.mStart` points at something nonsensical and `chars.mEnd` at the start of the string

[07:31:36.0485] <arai>
sounds like calling convention issue

[07:33:43.0169] <arai>
can the nonsensical value be a part of cx?

[07:40:27.0330] <Ms2ger>
`0x7ffff0001920` seems like a plausible pointer, at least

[07:40:53.0112] <Ms2ger>
Maybe another question: what does `cx` look like within `JS::StringToBigInt`

[07:42:13.0038] <Redfire>
`cx` is `0x7ffff0001920` in both

[07:43:07.0931] <arai>
so, in the C++ side, both `cx` and `chars.mStart.mPtr` point same value?

[07:44:38.0623] <Redfire>
`cx` and `chars.mStart.mPtr` are the same, but `chars.mStart.mRange{Start,End}` are ???

[07:52:44.0748] <arai>
I wonder if there's `DEBUG` option mismatch, because `mRangeStart` is defined only on debug build

[07:52:50.0205] <arai>
[RangedPtr.h](https://searchfox.org/mozilla-central/rev/1a63fee6c2a8ea6846f6f16b85edeb6d19fc9f23/mfbt/RangedPtr.h#50-53)

[07:53:09.0958] <arai>
not sure if that causes the mismatch in the point of function call tho

[07:54:55.0117] <Redfire>
This is a debug build, I'm gonna try gdb on a non-debug build in a sec, but that'll take a while

[07:55:01.0827] <Ms2ger>
But then mEnd.mRangeEnd in C++ couldn't match mStart.mRangeEnd in Rust, right?

[07:56:23.0602] <Redfire>
`chars` seems to be 24 bytes off where it should be in debug mode

[07:58:10.0444] <padenot>
`ptype` can help in gdb, to print the struct layout

[07:58:14.0988] <Ms2ger>
Well, glad this isn't my responsibility anymore. Good luck :)

[08:04:49.0011] <Redfire>
padenot: 
```cpp
(gdb) ptype /o chars
/* offset      |    size */  type = struct mozjs_sys::generated::root::mozilla::Range<u8> {
/*      0      |      24 */    mStart: mozjs_sys::generated::root::mozilla::RangedPtr<u8>,
/*     24      |      24 */    mEnd: mozjs_sys::generated::root::mozilla::RangedPtr<u8>,
/*     48      |       0 */    _phantom_0: core::marker::PhantomData<core::cell::UnsafeCell<u8>>,

                               /* total size (bytes):   48 */
                             }

/// Step
(gdb) ptype /o chars
/* offset      |    size */  type = class mozilla::Range<unsigned char const> [with T = const unsigned char] {
                             private:
/*      0      |      24 */    const class mozilla::RangedPtr<T const> [with T = const T] {
                                 private:
/*      0      |       8 */        const T *mPtr;
/*      8      |       8 */        const T * const mRangeStart;
/*     16      |       8 */        const T * const mRangeEnd;

                                   /* total size (bytes):   24 */
                               } mStart;
/*     24      |      24 */    const class mozilla::RangedPtr<T const> [with T = const T] {
                                 private:
/*     24      |       8 */        const T *mPtr;
/*     32      |       8 */        const T * const mRangeStart;
/*     40      |       8 */        const T * const mRangeEnd;

                                   /* total size (bytes):   24 */
                               } mEnd;

                               /* total size (bytes):   48 */
                             }
```

[08:06:56.0089] <Redfire>
Great, non-debug is even worse
```cpp
$2 = {mStart = {mPtr = 0x3239393137303039 <error: Cannot access memory at address 0x3239393137303039>}, mEnd = {
    mPtr = 0x3130303134373435 <error: Cannot access memory at address 0x3130303134373435>}}
```

[08:07:13.0443] <arai>
I wonder if the range overlaps both with Rust's `chars` and `range`

[08:07:52.0086] <arai>
if the struct layout differs, that can happen?

[08:08:46.0807] <arai>
can you check the address of those fields and local variables?

[08:09:16.0689] <arai>
(and non-debug build can optimize out some locals, that can make the situation worse)

[08:10:21.0916] <padenot>
