<!DOCTYPE html><html><head>
  <meta charset="UTF-8">
  <title>SpiderMonkey on 2023-12-07</title>
  <link rel="stylesheet" href="../style.css">
  <script>window.room = "SpiderMonkey";</script><script src="../render-roomlist.js"></script>
  <script src="../logs.js"></script>
</head>
<body><div class="wrapper">
<div class="sidebar">
<div class="title">SpiderMonkey<br>2023-12-07<br><a href="plaintext/">plaintext logs</a></div>
<div class="nav">
<a href="2023-12-06" class="nav-link"><span>prev</span></a>
<a href="2023-12-08" class="nav-link"><span style="float:right">next</span></a>
</div>
    <div class="all-rooms"><noscript>JavaScript is required to load the channel index, but you can go to <a href="../..">the static index</a> directly.</noscript></div>
<div class="footer"><a href="https://github.com/bakkot/matrix-archive-bot">source on github</a></div>
</div>
<div class="rhs">
<div class="rhs-header">
<span id="error" style="color: red; display:none">error</span>

<input type="text" id="query" size="25" placeholder="Search SpiderMonkey">
<a id="search-submit" class="button icon-link" title="Search">

  <tr class="msg" id="L23"><td class="ts-cell"><a class="ts" href="#L23" alt="Thu Dec 07 2023 07:52:50 GMT-0800 (Pacific Standard Time)">15:52</a></td><td class="nick-cell"><div class="m-ov">&lt;<span class="nick nick-15" title="@arai:mozilla.org">arai</span>&gt;</div></td><td class="msg-cell"><a href="https://searchfox.org/mozilla-central/rev/1a63fee6c2a8ea6846f6f16b85edeb6d19fc9f23/mfbt/RangedPtr.h#50-53">RangedPtr.h</a></td></tr>
  <tr class="msg" id="L24"><td class="ts-cell"><a class="ts" href="#L24" alt="Thu Dec 07 2023 07:53:09 GMT-0800 (Pacific Standard Time)">15:53</a></td><td class="nick-cell"><div class="m-ov">&lt;<span class="nick nick-15" title="@arai:mozilla.org">arai</span>&gt;</div></td><td class="msg-cell">not sure if that causes the mismatch in the point of function call tho</td></tr>
  <tr class="msg" id="L25"><td class="ts-cell"><a class="ts" href="#L25" alt="Thu Dec 07 2023 07:54:55 GMT-0800 (Pacific Standard Time)">15:54</a></td><td class="nick-cell"><div class="m-ov">&lt;<span class="nick nick-8" title="@redfire75369:mozilla.org">Redfire</span>&gt;</div></td><td class="msg-cell">This is a debug build, I'm gonna try gdb on a non-debug build in a sec, but that'll take a while</td></tr>
  <tr class="msg" id="L26"><td class="ts-cell"><a class="ts" href="#L26" alt="Thu Dec 07 2023 07:55:01 GMT-0800 (Pacific Standard Time)">15:55</a></td><td class="nick-cell"><div class="m-ov">&lt;<span class="nick nick-4" title="@ms2ger:igalia.com">Ms2ger</span>&gt;</div></td><td class="msg-cell">But then mEnd.mRangeEnd in C++ couldn't match mStart.mRangeEnd in Rust, right?</td></tr>
  <tr class="msg" id="L27"><td class="ts-cell"><a class="ts" href="#L27" alt="Thu Dec 07 2023 07:56:23 GMT-0800 (Pacific Standard Time)">15:56</a></td><td class="nick-cell"><div class="m-ov">&lt;<span class="nick nick-8" title="@redfire75369:mozilla.org">Redfire</span>&gt;</div></td><td class="msg-cell"><code>chars</code> seems to be 24 bytes off where it should be in debug mode</td></tr>
  <tr class="msg" id="L28"><td class="ts-cell"><a class="ts" href="#L28" alt="Thu Dec 07 2023 07:58:10 GMT-0800 (Pacific Standard Time)">15:58</a></td><td class="nick-cell"><div class="m-ov">&lt;<span class="nick nick-2" title="@padenot:mozilla.org">padenot</span>&gt;</div></td><td class="msg-cell"><code>ptype</code> can help in gdb, to print the struct layout</td></tr>
  <tr class="msg" id="L29"><td class="ts-cell"><a class="ts" href="#L29" alt="Thu Dec 07 2023 07:58:14 GMT-0800 (Pacific Standard Time)">15:58</a></td><td class="nick-cell"><div class="m-ov">&lt;<span class="nick nick-4" title="@ms2ger:igalia.com">Ms2ger</span>&gt;</div></td><td class="msg-cell">Well, glad this isn't my responsibility anymore. Good luck :)</td></tr>
  <tr class="msg" id="L30"><td class="ts-cell"><a class="ts" href="#L30" alt="Thu Dec 07 2023 08:04:49 GMT-0800 (Pacific Standard Time)">16:04</a></td><td class="nick-cell"><div class="m-ov">&lt;<span class="nick nick-8" title="@redfire75369:mozilla.org">Redfire</span>&gt;</div></td><td class="msg-cell"><p><span class="nick-2">padenot</span>:</p>
<pre><code class="language-cpp">(gdb) ptype /o chars
/* offset      |    size */  type = struct mozjs_sys::generated::root::mozilla::Range&lt;u8&gt; {
/*      0      |      24 */    mStart: mozjs_sys::generated::root::mozilla::RangedPtr&lt;u8&gt;,
/*     24      |      24 */    mEnd: mozjs_sys::generated::root::mozilla::RangedPtr&lt;u8&gt;,
/*     48      |       0 */    _phantom_0: core::marker::PhantomData&lt;core::cell::UnsafeCell&lt;u8&gt;&gt;,

                               /* total size (bytes):   48 */
                             }

/// Step
(gdb) ptype /o chars
/* offset      |    size */  type = class mozilla::Range&lt;unsigned char const&gt; [with T = const unsigned char] {
                             private:
/*      0      |      24 */    const class mozilla::RangedPtr&lt;T const&gt; [with T = const T] {
                                 private:
/*      0      |       8 */        const T *mPtr;
/*      8      |       8 */        const T * const mRangeStart;
/*     16      |       8 */        const T * const mRangeEnd;

                                   /* total size (bytes):   24 */
                               } mStart;
/*     24      |      24 */    const class mozilla::RangedPtr&lt;T const&gt; [with T = const T] {
                                 private:
/*     24      |       8 */        const T *mPtr;
/*     32      |       8 */        const T * const mRangeStart;
/*     40      |       8 */        const T * const mRangeEnd;

                                   /* total size (bytes):   24 */
                               } mEnd;

                               /* total size (bytes):   48 */
                             }
</code></pre>
</td></tr>
  <tr class="msg" id="L31"><td class="ts-cell"><a class="ts" href="#L31" alt="Thu Dec 07 2023 08:06:56 GMT-0800 (Pacific Standard Time)">16:06</a></td><td class="nick-cell"><div class="m-ov">&lt;<span class="nick nick-8" title="@redfire75369:mozilla.org">Redfire</span>&gt;</div></td><td class="msg-cell"><p>Great, non-debug is even worse</p>
<pre><code class="language-cpp">$2 = {mStart = {mPtr = 0x3239393137303039 &lt;error: Cannot access memory at address 0x3239393137303039&gt;}, mEnd = {
    mPtr = 0x3130303134373435 &lt;error: Cannot access memory at address 0x3130303134373435&gt;}}
</code></pre>
</td></tr>
